html/secrets/the-discovery-of-elias.html
---
title: "The Discovery Of Elia"
---
<div id="outline-container-the-discovery-of-elias" class="outline-2">
<h2 id="the-discovery-of-elias">The Discovery of Elias</h2>
<div class="outline-text-2" id="text-the-discovery-of-elias">
</div>
<div id="outline-container-introduction" class="outline-3">
<h3 id="introduction">Introduction</h3>
<div class="outline-text-3" id="text-introduction">
<p>
Elias Vorndur, an Edama Archive Guild scholar from Ornasion, set up a team of scholars and explorers to investigate a portal in one of the ancient Amearen cities in the Kaukloutan desert, called Aurunian, which layed just north of the mountains that separate the jungles of Vilesia and the Kouklatan desert, and also several pisecs north of Siyam Nagasi, the capital city of the Principality of Vilesia. The portal is said to be one that reaches the heavenly realm of the gods. The last expidition there had taken place several hundred years ago, and even though the party returned mostly intact, very little was actually recorded in what they found. Elias was going to put this mystery to rest, once and for all.
</p>
</div>
</div>
<div id="outline-container-outline" class="outline-3">
<h3 id="outline">Outline</h3>
<div class="outline-text-3" id="text-outline">
</div>
<div id="outline-container-portal-discovery" class="outline-4">
<h4 id="portal-discovery">Portal Discovery</h4>
<div class="outline-text-4" id="text-portal-discovery">
<p>
The party travels several stories underground before reaching the portal. They open their tomes of what is known of the ancient Amearan tongue and after several days, figure out how to activate the portal. Blue light shimmering the darknes and swirling around the portal&rsquo;s entrance, the party steps through to the other side. They enter a room made of metal, and lights that required no candle wax or oil. The windows of the room appeared to be viewing ports into the heavens. They could see spheres in the celestial realm, including Ora, the giant sphere in Naurrnen&rsquo;s sky, some of whom call &ldquo;moon&rdquo; and Naurrnen&rsquo;s two suns, like bright disks, yet darkness all around them, like something in the heavens was immune to their light, even though they appeared brighter than they did from Naurrnen.
</p>
</div>
</div>
<div id="outline-container-the-strange-throne" class="outline-4">
<h4 id="the-strange-throne">The Strange Throne</h4>
<div class="outline-text-4" id="text-the-strange-throne">
<p>
Walking further down the hall in this metal room, they found a throne that looked more like designed for function rather than for glorious majesty. They noticed the Amearan runes eched in the arm of the throne. Elias looked up at the other party members with a knowing smile, &ldquo;this&#x2026; oh, this!&rdquo; He remembered one of the ancient Amearan cantations that he had spent most of his career deciphering, and with a click of a button, the thrown moned into life. Light and switches on the throne came to life. Ellias eager to try this unique device, sat on the thrown, entered an Amearan script he had prepared for this moment, and then&#x2026;. the spherical door, encloses around the throne encaseing Elias in the chair. A view port in front of him, enables to view the others from his expidition. But they are not moving normally, but they suddenly appear to be moving very fast. Inhumanly fast. They look like they are trying to fre Elias from the sphere, but they are moving far too fast. Wait, where are they going? &ldquo;They are leaving me here!? Why?&rdquo;
</p>
</div>
</div>
<div id="outline-container-a-strange-land" class="outline-4">
<h4 id="a-strange-land">A Strange Land</h4>
<div class="outline-text-4" id="text-a-strange-land">
<p>
Elias&rsquo; panic is interrupted as he seems to have transported somewhere away from his spherical trap. But he is also no longer alone. He observes two Adama ment wearing clothing he has never seen before. They were both wearing the same outfit and had goggles on their foreheads. &ldquo;Hello? Who are you?&rdquo; asked Elias. The men stopped what they were doing and turned to look at Elias with a rather astonished look on their faces. They responded, seemingly friendly, but Elias could not understand what they were saying.
</p>
</div>
</div>
</div>
</div>
